# Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів в списку. 
# Тобто, функція приймає два аргументи: список і величину зсуву 
# (якщо ця величина додатня - пересуваємо з кінця на початок, якщо від'ємна - навпаки - пересуваємо елементи з початку списку в його кінець).
#    Наприклад:
#        fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
#        fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]

list1 = [1,2,3,4,5,6,7,8,9,10]
n = -1

def offset (lst, shift = 0):
    if n > 0:
        lst = lst[:shift] + lst[shift:]
    elif n <0:
        lst = lst[shift:] + lst[:shift]
    print(lst)
    return(lst)

offset(list1, n)