# Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність (рядок, список, кортеж) і повертає генератор, 
# який буде вертати значення з цієї послідовності, при цьому, якщо було повернено останній елемент із послідовності - ітерація починається знову.
#    Приклад (якщо запустили його у себе - натисніть Ctrl+C ;) ):
#    >>>for elem in generator([1, 2, 3]):
#    ...    print(elem)
#    ...
#    1
#    2
#    3
#    1
#    2
#    3
#    1
#    .......

# не працює

interP1 = [1,2,3]

def pressCtrlC(iterP1):
    for _ in iterP1:
        print (_)
            
print (obj, pressCtrlC(iterP) for _ in iterP if _ == iterP[-1])